{
  "backend/main.mo": "Main actor implementing a luxury watch e-commerce backend with CRUD operations for watches (supporting up to 5 images per watch), cart management, search/filter functionality, and blob storage integration via MixinStorage.",
  "backend/migration.mo": "Migration module that transforms old Watch records with single 'image' field to new Watch records with 'images' array field, wrapping the single image in an array.",
  "feature_evidence.json": "Feature evidence report documenting implementation of multi-image support across AddWatchForm, EditWatchModal, ProductCard, and ProductDetailPage components with high confidence test mappings.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks describing their functionality, including multi-image support, routing, admin features, and luxury styling with black/gold theme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for luxury brand styling.",
  "frontend/index.html": "HTML entry point for the React application with title 'Luxury In Times' and root div mounting point.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, product detail, cart, contact, admin login, and admin dashboard, wrapped with ThemeProvider and Toaster.",
  "frontend/src/components/admin/AddWatchForm.tsx": "Admin form for adding new watches with fields for name, company, model, price, gender, description, featured status, and up to 5 images. Handles image preview and submission to backend actor.",
  "frontend/src/components/admin/DeleteConfirmationDialog.tsx": "Displays an AlertDialog for confirming watch deletion with Cancel and Delete buttons, showing loading state during deletion.",
  "frontend/src/components/admin/EditWatchModal.tsx": "Modal component for editing watch details including name, company, model, price, gender, description, featured status, and managing up to 5 images (existing and new). Handles form submission to update watch data via actor and invalidates queries on success.",
  "frontend/src/components/admin/WatchManagementList.tsx": "Displays a list of all watches with edit and delete actions, showing watch thumbnails and details. Handles watch deletion with confirmation dialog and invalidates queries after successful operations.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks sessionStorage for 'adminAuth' flag and redirects unauthenticated users to admin login page.",
  "frontend/src/components/FeaturedWatches.tsx": "Displays featured watches in a responsive grid with clickable cards showing the first image from images array, loading skeletons, and error handling.",
  "frontend/src/components/FilterSidebar.tsx": "Provides a filter sidebar component with price range slider, gender and brand checkboxes, and price sorting options (asc/desc/none). Includes both desktop and mobile (Sheet) layouts for filtering watch products.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with four columns: About, Contact (phone number), Instagram link, and Quick Links navigation. Includes copyright notice and caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Displays the sticky header with logo, desktop navigation (Home, Products, Contact, Cart), and mobile menu using Sheet component. Shows cart item count badge when items are present.",
  "frontend/src/components/InstagramSection.tsx": "Renders a call-to-action section encouraging users to follow the brand's Instagram account (@luxury_in_times_) with a styled button link.",
  "frontend/src/components/Layout.tsx": "Provides the main layout wrapper with Header, Outlet for page content, and Footer in a flex column structure.",
  "frontend/src/components/ProductCard.tsx": "Displays a watch product card with image, name, company, model, gender, price, and 'Add to Cart' button. Links to product detail page and handles cart addition with toast notifications.",
  "frontend/src/components/SearchBar.tsx": "Renders a search input field with icon for filtering products by name, company, or model number.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Custom hook managing shopping cart operations (add, remove, update quantity) with local storage-based user identification. Provides cart items, total, count, and mutation functions with automatic query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle. Provides authentication status, identity object, and login/clear functions to child components.",
  "frontend/src/hooks/useWatches.ts": "Custom hook that fetches all watches and featured watches from the backend actor using React Query. Returns watch data, loading states, and errors for both queries.",
  "frontend/src/index.css": "Global styles defining luxury brand color palette (black, gold, champagne, ivory) using OKLCH color space, custom font imports (Playfair Display, Inter), and Tailwind CSS configuration with design system tokens.",
  "frontend/src/lib/imageUtils.ts": "Utility functions for converting Uint8Array image data to blob URLs for display and revoking blob URLs to free memory.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component with necessary context providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for adding new watches and managing existing watches, includes logout functionality with session storage.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page with password authentication (hardcoded password 'GRANTH') that stores auth state in sessionStorage and redirects to admin dashboard.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, remove functionality, and total price calculation; shows empty state when cart is empty.",
  "frontend/src/pages/ContactPage.tsx": "Contact information page displaying phone number (+91 7572939000), Instagram handle (@luxury_in_times_), and business hours in a styled layout.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section featuring background image and call-to-action, plus featured watches and Instagram sections.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing individual watch information with image carousel, specifications, and add-to-cart functionality; fetches watch data by ID from backend actor.",
  "frontend/src/pages/ProductListingPage.tsx": "Product listing page with search, filtering (price, gender, brand), and sorting capabilities; displays watches in a grid layout with loading and error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a luxury design system with OKLCH color variables (black/gold/white palette), custom fonts (Playfair Display serif, Inter sans), container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting a luxury watch e-commerce platform 'Luxury In Times' with features including homepage, product listings, search/filters, shopping cart, admin panel (password: GRANTH), contact page, and multi-image product galleries; backend uses Motoko canisters on Internet Computer."
}